/*2020/11/16 0312020041 堅岡周作*/
/*自由課題f5-1*/
#include<stdio.h>
int main(void) {
	int tensu[2][4][3]
		= { {{91,63,78},
			 {67,72,46},
			 {89,34,53},
			 {32,54,34}},

		   {{97,67,82},
			{73,43,46},
			{97,56,21},
			{85,46,35}} };
	int sum[4][3],i,j;

	for (i = 0; i <4 ; i++) {
		for (j = 0; j < 3; j++) {
			sum[i][j] = tensu[0][i][j] + tensu[1][i][j];
		}
	}
	printf("1回目の点数\n");
	for (i = 0; i < 4; i++) {
		for (j = 0; j < 3; j++) {
			printf("%4d", tensu[0][i][j]);
		}
		printf("\n");
	}
	printf("2回目の点数\n");
	for (i = 0; i < 4; i++) {
		for (j = 0; j < 3; j++) {
			printf("%4d", tensu[1][i][j]);
		}
		printf("\n");
	}
	printf("合計点\n");
	for (i = 0; i < 4; i++) {
		for (j = 0; j < 3; j++) {
			printf("%4d", sum[i][j]);
		}
		printf("\n");
	}
	return 0;
}

/*実行結果
1回目の点数
  91  63  78
  67  72  46
  89  34  53
  32  54  34
2回目の点数
  97  67  82
  73  43  46
  97  56  21
  85  46  35
合計点
 188 130 160
 140 115  92
 186  90  74
 117 100  69

このウィンドウを閉じるには、任意のキーを押してください...

*/